app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
   def index
     @restaurant = Restaurant.all

INSERT INTO "restaurants" ("name", "street", "city", "state", "country", "postal_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
   def create
     @restaurant = Restaurant.create(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "restaurants" SET "street" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["street", "52 Vanderbilt Avenuet "], ["updated_at", "2016-05-16 22:26:52.322570"], ["id", 9]]
---
   def update
     @restaurant = Restaurant.find_by_id(params[:id])
       @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]
---
   def destroy
     @restaurant = Restaurant.find(params[:id])
       @restaurant.delete